
Процедура ИсполняемыеСценарии() Экспорт 
	ЮТТесты.ДобавитьТестовыйНабор("ПроверкаRabbitMQ")
	.ДобавитьТест("ПолучитьПараметрыRabbitMQ", "Проверить параметры", "")
	.ДобавитьТест("ПолучитьСтруктуруИзJSON", "Проверить JSON структуру", "");//.ВТранзакции();   
	
	ЮТТесты.ДобавитьТестовыйНабор("Создание документов")
	.ДобавитьТест("ПроверкаСозданияЗаказа", "Проверить создание заказа", "")
	.ДобавитьТест("ПроверкаСозданияПродажи", "Проверить создания продажи", "").ВТранзакции();
	
 КонецПроцедуры             
   
Процедура ПолучитьПараметрыRabbitMQ()  Экспорт   
	// Параметры = Новый Структура("ОтветноеСообщение");
	//Параметры.Вставить("Адрес", "192.168.31.10");
	//Параметры.Вставить("Порт",5672);
	//Параметры.Вставить("Логин", "1");
	//Параметры.Вставить("Пароль", "1");
	//Параметры.Вставить("ВиртуальныйХост", "/");
	//
	//Параметры.Вставить("ТочкаОбмена", "orders");
	//Параметры.Вставить("ИмяОчереди","orders01");
	//Параметры.Вставить("ТекстСообщения","test");     
	
	Тест = Обработки.RabbitMQ.ПолучитьПараметры();
	
	ЮТест.ОжидаетЧто(Тест)
		.ИмеетТип("Структура")
		.Свойство("Адрес").Равно("192.168.31.10")
		.Свойство("Порт").Равно(5672) 
		.Свойство("Логин").Равно("1")
		.Свойство("Пароль").Равно("1")
		.Свойство("ВиртуальныйХост").Равно("/")
		.Свойство("ТочкаОбмена").Равно("orders")
		.Свойство("ИмяОчереди").Равно("orders01")
		
КонецПроцедуры                        
	


Процедура ПолучитьСтруктуруИзJSON() Экспорт

JSON = "{
    |""document"": ""CustomerOrder"",
    |""id"": ""000000008"",
    |""date"": ""2025-09-30T16:35:00"",
    |""inn"": ""223456789"",
    |""items"": [
    |    {
    |        ""id"": ""000000002"",
    |        ""quantity"": 4,
    |        ""price"": 1000,
    |        ""amount"": 4000
    |    }
    |]}";  

	Тест = БотСервер.JsonВСтруктуру(JSON);
	
	ЮТест.ОжидаетЧто(Тест)
		.ИмеетТип("Структура")
		.Свойство("date").Равно("2025-09-30T16:35:00")
		.Свойство("inn").Равно("223456789") 
		//.Свойство("Логин").Равно("1")
		//.Свойство("Пароль").Равно("1")
		//.Свойство("ВиртуальныйХост").Равно("/")
		//.Свойство("ТочкаОбмена").Равно("orders")
		//.Свойство("ИмяОчереди").Равно("orders01")


КонецПроцедуры

Процедура ПроверкаСозданияЗаказа() Экспорт

	Покупатель 		= Справочники.Контрагенты.НайтиПоКоду("000000002");  
	НашаОрганизация = Справочники.Организации.НайтиПоКоду("000000001");  
	СостояниеЗаказа = Перечисления.СостоянияЗаказов.ВРаботе;
	
	Дата = НачалоДня(ТекущаяДата());
	НовыйДок = ЮТест.Данные().КонструкторОбъекта("Документы.Заказ")
	.ФикцияОбязательныхПолей()
	.Установить("Дата",Дата)  
	.Установить("Покупатель",Покупатель)
	.Установить("СостояниеЗаказа",СостояниеЗаказа)   
	.Установить("Организация",НашаОрганизация) 
	.ФикцияРеквизитов("Склад,Валюта,ВидЦен,Организация")
	.Записать();	

	ЮТест.ОжидаетЧто(НовыйДок)
		.ИмеетТип("ДокументСсылка.Заказ")
		.Свойство("Дата").Равно(НачалоДня(ТекущаяДата()))
		.Свойство("Покупатель").Равно(Покупатель)
		.Свойство("СостояниеЗаказа").Равно(СостояниеЗаказа)
		
		


КонецПроцедуры

Процедура ПроверкаСозданияПродажи() Экспорт

	Покупатель 		= Справочники.Контрагенты.НайтиПоКоду("000000002");  
	НашаОрганизация = Справочники.Организации.НайтиПоКоду("000000001");  
	Заказ 			= Документы.Заказ.НайтиПоНомеру("000000009",ТекущаяДата());
	
	Дата = НачалоДня(ТекущаяДата());
	НовыйДок = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
	.ФикцияОбязательныхПолей()
	.Установить("Дата",Дата)  
	.Установить("Покупатель",Покупатель)
	.Установить("Заказ",Заказ)   
	.Установить("Организация",НашаОрганизация) 
	.ФикцияРеквизитов("Склад,Валюта,ВидЦен,Организация")
	.Записать();	

	ЮТест.ОжидаетЧто(НовыйДок)
		.ИмеетТип("ДокументСсылка.РасходТовара")
		.Свойство("Дата").Равно(НачалоДня(ТекущаяДата()))
		.Свойство("Покупатель").Равно(Покупатель)
        .Свойство("Заказ").Равно(Заказ)
КонецПроцедуры

 //000000009